[LANG]
language=繁体中文 (台湾)
[FONT]
font-name=Microsoft Yahei UI
welcome-text-size=64
home-text-size=24
home-section-size=26
analysis-text-size=22
analysis-section-size=24
left-panel-size=18
panel-list-size=18
panel-list-label-size=22
panel-list-header-size=18
panel-list-item-size=15
panel-button-size=14
combobox-size=18
list-combobox-size=18
checkbox-size=16
radio-size=17
elem-size=12
image-button-size=16
form-text-size=17
list-text-size=18
search-edit-size=18
message-text-size=18
setting-button-size=14
process-text-size=16
properites-title-font=20
properites-section-font=18
log-list-item-text-size=14
log-list-item-sql-size=16
[ERROR]
000000=
200001=SQL 語法錯誤
200002=檔案不存在
200003=檔案損毀
200004=參數錯誤
200026=資料表名稱已重複
200027=資料表名稱不存在
200028=匯入 CSV 檔案錯誤，未能生成 SQL，請檢查 CSV 檔案內容和設定項是否正確
300001=未選取建立索引的資料表欄位
300002=SQL 陳述式不能為空
300003=SQL 分析僅支援 SELECT 查詢陳述式
[STRING]
home=首頁
database=資料庫
analysis=分析
view=視圖
setting=設定
items=筆記錄
tables=資料表
views=視圖
triggers=觸發器
columns=欄位
indexes=索引
table=資料表
clear-all=全部清除
yes=確定
no=取消
welcome-text=歡迎來到 CuteSqlite
home-text1=CuteSqlite 是 Sqlite3 的圖形使用者介面（GUI）工具。
home-text2=它允許您設計、建立和瀏覽資料庫、處理資料庫物件，
home-text3=和插入資料以及設計和執行 SQL 查詢以處理儲存的資料。
home-text4=您還可以將資料庫和資料從其他資料庫供應商遷移到 Sqlite 資料庫。
db-section-text=Sqlite 資料庫
analysis-text1=CuteSqlite 允許您分析和優化 SQL 陳述式的效能。
analysis-text2=而且允許您分析資料庫每張表的儲存容量，
analysis-text3=以及設定資料庫的參數，來優化資料庫。
perf-analysis-section-text=效能分析
error-text=系統錯誤：
create-database=新增一個資料庫 (Ctrl+N)
open-database=開啟一個資料庫 (Ctrl+O)
refresh-database=重新整理資料庫 (F5)
delete-database=移除清單中選取資料庫 (Del)
override-user-db=檔案的資料刪除後無法復原，確定是否覆蓋資料庫？
create-db-success-text=資料庫建立成功
open-db-exists-inlist=資料庫已開啟，請勿重複操作
open-db-success-text=資料庫開啟成功
delete-user-db=確定從清單中移除選取的資料庫 "{dbName}"？
delete-db-success-text=從清單中移除資料庫成功
query-editor=查詢編輯器
history=歷史記錄
history-tip=歷史記錄 (F8)
result-list=結果
result-info=資訊
result-table-data=資料表資料
table-properties=資料表屬性
exec-select-sql=執行目前選取的查詢 (F9)
exec-all-sql=執行所有查詢 (F10)
explain-select-sql=Explain 目前選取的 SQL 陳述式 (F11)
explain-query-plan-sql=Explain query plan 目前選取的 SQL 陳述式 (F12)
query-page-help=自動完成功能：[Tab]->下一個標籤；[Ctrl+Space]->列出相符的標籤；[Ctrl+Enter]->列出所有的標籤
no-select-userdb=未選取資料庫
no-sql-statement=查詢編輯器未輸入 SQL 陳述式
no-sql-content=查詢編輯器無 SQL 陳述式
show-form-view=顯示表單視圖
export-result-as=匯出為... (Ctrl+Alt+E)
copy-result-data=複製資料到剪貼簿
clear-all=全部清除
ok=確定
cancel=取消
export-text-description=選擇匯出資料的格式
csv-settings=csv 選項
csv-field-settings=欄位
csv-line-settings=列
csv-charset-settings=編碼
excel-settings=Excel 選項
sql-settings=SQL 選項
export-fields-settings=選擇要匯出的欄位
terminated-by=分隔符號
enclosed-by=包圍符號
escaped-by=跳脫符號
field-terminated-by=欄位分隔符號
field-enclosed-by=欄位包圍符號
field-escaped-by=欄位跳脫符號
line-terminated-by=換行符號
add-column-name=標頭新增欄位名稱
csv-charset=編碼
excel-column-max-size=文字欄大小限制
excel-decinmal-places=小數位數
structure-only=僅資料表結構
data-only=僅資料
structure-and-data=資料表結構和資料
select-all=全選
deselect-all=取消全選
save-to-file=匯出至檔案
expert-fmt-error=請選擇資料匯出的檔案格式
terminated-by-error=請輸入「終止於」的值
enclosed-by-error=請輸入「包圍於」的值
escaped-by-error=請輸入「跳脫符號」的值
line-terminated-by-error=列的「終止於」的值不正確
excel-column-max-size-error=請輸入「文字欄大小限制」的值
excel-decinmal-places-error=請輸入「小數位數」的值
export-sql-error=請選擇 SQL 選項
selected-fields-error=請選擇匯出的欄位
export-path-error=請輸入匯出檔案的路徑
sql-notsupport-multitable-query-error=不支援多表查詢和子查詢的結果匯出
export-success-text=匯出成功，已匯出{rows}列資料，是否開啟檔案？
open-the-file=開啟檔案
export-file-exists-prompt={export-path} 已存在，是否取代？
limit-rows=限制列數
offset=起始列
rows=列數
copy-all-rows-to-clipboard=複製所有列到剪貼簿	Ctrl+Alt+A
copy-sel-rows-to-clipboard=複製選取列到剪貼簿	Ctrl+Alt+H
copy-all-rows-as-sql=所有列複製為 SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=選取列複製為 SQL	Ctrl+Alt+K
read-only=唯讀
filter=篩選器 (Ctrl+Alt+F)
filter-in-use=篩選器使用中
refresh=重新整理 (Ctrl+F5)
refresh-page=重新整理頁面
new-row-tip=新增一列 (Ctrl+Alt+N)
copy-row-tip=複製一列 (Ctrl+Alt+C)
save-tip=儲存 (Ctrl+Alt+S)
delete-tip=刪除選取列 (Ctrl+Del)
cancel-tip=復原變更 (Ctrl+Alt+Z)
revert-tip=還原
save=儲存
revert=復原變更
column=欄位名稱
condition=條件
value=值
delete-confirm-text=確定刪除選取列？
query=查詢
result=結果
affected-rows=影響列數
exec-time=執行耗時
transfer-time=傳輸耗時
total-time=總耗時
database-create=新增資料庫		Ctrl+N
database-open=開啟資料庫		Ctrl+O
database-refresh=重新整理資料庫		Ctrl+R
database-delete=刪除資料庫		Del
database-copy=複製資料庫為...	Ctrl+P
database-export-as-sql=匯出資料庫至 SQL	Ctrl+E
database-import-from-sql=匯入 SQL 至資料庫	Ctrl+I
database-new=建立
database-new-table=資料表
database-new-view=視圖
database-new-trigger=觸發器
export-as-sql-text-description=以 SQL 的方式匯出選取資料庫的資料表/視圖/觸發器
select-database=選取的資料庫
database-objects=物件
structure-and-data-settings=結構和資料設定
insert-statement-settings=INSERT 陳述式設定
tbl-statement-settings=資料表陳述式設定
retain-column-text=在「Insert Into」中保留欄位名稱
contain-multi-rows-text=每條「Insert」陳述式包含多列 (VALUES)
retain-table-text=保留舊表 (Create Table If Not Exists ...)
override-table-text=覆蓋舊表 (DROP TABLE, 然後 CREATE TABLE)
import-from-sql-text-description=批次執行在 SQL 檔案中的陳述式。
abort-on-error-text=出錯時終止。
import-file-not-exists=匯入的 SQL 檔案不存在，請重新選擇。
import-path-empty-error=匯入的檔案路徑不能為空。
import=匯入
export=匯出
tbl-name=資料表名稱
new-table=建立資料表
new-view=建立視圖
new-trigger=建立觸發器
database=資料庫
schema=Schema
table-columns=欄位
table-indexes=索引
table-foreignkeys=外鍵
column-name=欄位名稱
data-type=資料類型
default=預設
check=檢查
index-name=索引名稱
index-type=索引類型
index-unique=Unique
partial-clause=部分子句
comments=註釋
to-be-selected=待選的欄位
selected=已選的欄位
up=▲
down=▼
no-columns-selected=未選擇欄位，請選擇
sql-preview=SQL 預覽
tbl-name-empty=資料表名稱不能為空
tbl-name-duplicated=資料表名稱已重複
create-table-success-text=資料表建立成功。
alter-table-success-text=資料表修改成功。
rename-table-success-text=資料表名稱修改成功。
delete-column-confirm-text=所選欄位由一個或多個索引引用。刪除此欄位還將修改相應的索引。確定繼續刪除嗎？
delete-index-confirm-text=所選索引由一個或多個欄位引用。刪除此索引還將修改相應的欄位。確定繼續刪除嗎？
delete-confirm-text=確定繼續刪除嗎？
new-view=建立視圖
new-trigger=建立觸發器
create-a-view-name=新視圖名稱
view-name-not-empty=新視圖名稱不能為空
view-name-duplicated=視圖名稱已重複
create-a-trigger-name=觸發器名稱
trigger-name-not-empty=觸發器名稱不能為空
trigger-name-duplicated=觸發器名稱已重複
execute-sql-success=SQL 執行成功
copy-db-success-text=資料庫複製成功
table-open=開啟資料表資料		Alt+O
table-create=建立資料表		Alt+N
table-alter=修改資料表		Alt+A
table-rename=重新命名資料表		Alt+M
table-truncate=清空資料表		Alt+T
table-drop=刪除資料表		Alt+Del
table-copy-as=複製資料表到...		Alt+P
table-sharding-as=分片		Alt+G
table-export=匯出資料表到...	Alt+E
table-import-sql=從 SQL 檔案匯入	Alt+I
table-import-csv=從 CSV 檔案匯入	Alt+J
table-manage-index=管理資料表索引
table-manage-foreign-key=管理資料表外鍵
properties=屬性
primary-key-duplicated=主鍵 (Primary key) 重複定義。
foreignkey-name=外鍵名稱
referencing-columns=本表欄位
referenced-table=外聯表
referenced-columns=外聯欄位
on-update=On Update
on-delete=On Delete
insert-new-column=新增新欄位
insert-new-index=新增新索引
insert-new-foreignkey=新增新外鍵
insert-del-column=刪除選取欄位
insert-del-index=刪除選取索引
insert-del-foreignkey=刪除選取外鍵
select-referenced-table-first=請先選擇外聯表
new-table-name=新資料表名稱
table-name-not-empty=新資料表名稱不能為空
table-name-duplicated=新資料表名稱已重複
ai-column-exists=自增欄位 (AUTOINCREMENT) 已存在。
ai-fobidden-multi-pk=已有自增欄位 (AUTOINCREMENT)，不允許多個主鍵欄位。
ai-column-must-integer=自增欄位 (AUTOINCREMENT) 必須為 INTEGER 整數類型。
truncate-table-confirm-text=清空資料表後，資料不可復原，確定清空嗎？
truncate-table-success-text=成功清空資料表
drop-table-confirm-text=刪除資料表後，資料不可復原，確定刪除嗎？
drop-table-success-text=成功刪除資料表
copy-table-text-description=設定複製參數，支援資料表分片
from-db-name=源資料庫
from-tbl-name=源資料表
to-db-name=目標資料庫
to-tbl-name=目標資料表
table-sharding-setttings=資料表分片
enable-table-sharding=啟用資料表分片
table-suffix-begin={suffix} 開始整數
table-suffix-end={suffix} 結束整數
advanced-settings=表分片進階選項
enable-copy-data-with-strategy=啟用策略，將資料複製到分片表
sharding-strategy-express-text=分表策略運算式：{n}
preview-sql=預覽 SQL 陳述式
structure-and-data-settings-unknown=結構和資料設定未選擇
table-suffix-error=分片整數無效，請填寫正確的值
target-table-name-no-n=目標表必須包含字串 "{n}".
sharding-strategy-express-empty=分表策略運算式不能為空
copy-table-success-text=資料表複製成功。
start=開始
complete=完成
express-title=表分片策略運算式
functions=函數
express-editor-help=運算式 - 雙擊函數或欄位，插入到編輯器
import-from-csv-text-description=從 CSV 檔案匯入資料的設定項
source-csv-file=源 CSV 檔案路徑
target-database=目標資料庫
target-table=目標資料表
columns-setttings=欄位
csv-data=CSV 資料
column-name-on-top=第一列作為欄位名稱
line-terminated-by=換行符號
csv-null-as-keyword=null/NULL 作為 SQL 關鍵字
encoding=Encoding
import-success-text=匯入成功
incorrect-sql-statement=錯誤的 SQL 陳述式
import-error-text=匯入錯誤
table-manage-columns=管理欄位
table-drop-column=刪除欄位
table-manage-indexes=管理索引
table-drop-index=刪除索引
create-view=建立新視圖
open-view=開啟視圖
drop-view=刪除視圖
create-trigger=建立觸發器
open-trigger=開啟觸發器
drop-trigger=刪除觸發器
drop-view-confirm-text=刪除視圖後，視圖不可復原，確定刪除嗎？
drop-view-success-text=成功刪除視圖
drop-trigger-confirm-text=刪除觸發器後，觸發器不可復原，確定刪除嗎？
drop-trigger-success-text=成功刪除觸發器
sql-templates=SQL 陳述式範本
pragma-templates=Pragmas
sql-log=SQL 歷史記錄
clear-all=全部清除
use=使用
explain=Explain
top=置頂
untop=取消置頂
copy=複製
delete=刪除
today=今天
yestoday=昨天
delete-sql-log-confirm-text=你確定要刪除 SQL 日誌嗎？
copy-to-clipboard=已複製到剪貼簿
save-success-text=儲存成功
delete-success-text=刪除成功
data-has-changed=資料已更改，您確定要關閉頁面嗎？
not-save-and-close=不儲存，關閉
cancel=取消關閉
table-export-as=匯出資料表	Alt+E
export-as-sql-success-text=匯出成功，是否開啟檔案？
new-query=新增查詢視窗 (F7)
save-current=儲存目前 (Ctrl+S)
save-all=儲存所有 (Ctrl+Shift+S)
first-page=首頁
prev-page=上一頁
next-page=下一頁
last-page=末頁
save-if-data-has-changed=資料已更改，確定先儲存嗎？
unsort=取消排序
tab-close-this=關閉
tab-close-others=關閉非目前
tab-close-left=關閉左邊所有
tab-close-right=關閉右邊所有
perf-analysis=效能分析
perf-analysis-reports=分析報告
store-analysis=儲存分析
db-params=資料庫參數
not-select-sql=僅支援 SELECT 陳述式
open-sql-log=開啟 SQL 日誌進行效能分析 (Ctrl+L)
add-sql-analysis=輸入 SQL 陳述式進行效能分析 (Ctrl+I)
sql-log-not-found=未找到 SQL 日誌，請檢查是否已刪除
original-sql=原始的 SQL 陳述式
where-clause-analysis=WHERE 子句分析
order-clause-analysis=ORDER 子句分析
covering-index-analysis=覆蓋索引分析
table-join-analysis=Joins 分析
in-table=資料表
where-use-column=WHERE 陳述式使用了欄位
order-use-column=ORDER 陳述式使用了欄位
covering-index-column=WHERE 和 ORDER 陳述式使用了欄位
where-use-index=WHERE 陳述式使用了索引
order-use-index=ORDER 陳述式使用了索引
use-covering-index=使用了覆蓋索引
create-index-for-performance=建議：為以下欄位建立索引，能提升查詢效能
hint-index-for-performance=提示：索引{hintIndexName} 已覆蓋包含的欄位：{hintIndexColumns}
create-covering-index-for-performance=建議：為以下欄位建立覆蓋索引，能提升查詢效能
create-index-togeger=建立索引
create-index-individ=單獨建立索引
create-covering-index=建立覆蓋索引
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=下面的虛擬碼展示查詢優化器的執行過程
cycle-count=循環統計
optimize-cycle-count=提示：更改 JOIN 表不同的順序，可以優化減少循環次數。
general-settings=通用設定
about=關於
language-setting=介面語言設定
change-language-restart-text=更改語言，必須重新啟動本軟體才生效。
close-and-restart=關閉重新啟動
do-not-restart=不重新啟動
about-us=關於我們
about-us-description=CuteSqlite 由作者 Xuehan Qin 開發一款開源軟體。
version-info=版本
version-info-description=CuteSqlite v0.2.2 beta (64 位元)
feedback=回饋
feedback-description=如果您有軟體問題，或對此應用程式有想法和建議，請填寫下表回饋給我們。
content-text=內容
license=Apache License Version 2.0
select-columns-analysis=Select 欄位分析
select-use-column=Select 陳述式使用了以下欄位
select-use-column-count=欄位數
select-use-column-advice=建議：SELECT 陳述式選擇的欄位超過了{maxColumns} 個，盡量減少欄位，能提升查詢效能。
select-use-column-tips=提示：盡量減少欄位，能提升查詢效能。
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=儲存分析：
analysis-sql=SQL 分析
open-perf-report=開啟報告		Alt+O
drop-perf-report=刪除報告		Alt+Del
drop-perf-report-confirm-text=確定刪除報告嗎？
store-analysis-text=允許您分析資料庫，資料表，表索引的儲存容量
table-store-analysis=表 - {tblName}
index-store-analysis=索引 - {idxName} - 所屬表:{tblName}
db-disk-used-title=磁碟空間利用率報告，DB 路徑:{dbPath}
page-size-text=頁大小 (單位：位元組)
page-size-tips=頁大小 (單位：位元組)
file-bytes-text=檔案大小 (單位：位元組)
file-bytes-tips=檔案大小 (單位：位元組)
file-pgcnt-text=整個檔案中的頁數 (測量值)
file-pgcnt-tips=整個檔案中的頁數 (測量值)
file-pgcnt2-text=整個檔案中的頁數 (計算值)
file-pgcnt2-tips=整個檔案中的頁數 (計算值)
inuse-pgcnt-text=儲存資料的頁數 (已用)
inuse-pgcnt-tips=儲存資料的頁數 (已用)
free-pgcnt2-text=未儲存資料的頁數 (每個頭部)
free-pgcnt2-tips=未儲存資料的頁數 (每個頭部)
free-pgcnt-text=未儲存資料的頁數 (計算值)
free-pgcnt-tips=未儲存資料的頁數 (計算值)
av-pgcnt-text=自動清空的頁數
av-pgcnt-tips=自動清空的頁數
ntable-text=資料庫中的表數
ntable-tips=資料庫中的表數
nindex-text=索引數
nindex-tips=索引數
nmanindex-text=定義索引數
nmanindex-tips=定義索引數
nautoindex-text=隐含索引數 (自增索引)
nautoindex-tips=隐含索引數 (自增索引)
user-payload-text=使用者有效負載儲存的位元組數
user-payload-tips=使用者有效負載儲存的位元組數
all-tbl-entrycnt-title=所有表資料量 (筆數)
all-tbl-idx-pagecnt-title=所有表及其索引的頁數
sperate-tbl-idx-pagecnt-title=所有表和索引的頁數分別計算
all-tbl-idx-report-title=所有表格和索引
total-pages-percent-text=佔資料庫總數的百分比
total-pages-percent-tips=佔資料庫總數的百分比
nentry-text=資料量 (筆數)
nentry-tips=資料量 (筆數)
storage-text=消耗的儲存位元組數
storage-tips=消耗的儲存位元組數
compressed-size-text=壓縮後使用的位元組數
compressed-size-tips=壓縮後使用的位元組數
payload-text=有效負載的位元組數
payload-tips=有效負載的位元組數
total-meta-text=元資料的位元組數
total-meta-tips=元資料的位元組數
depth-text=B 樹深度
depth-tips=B 樹深度
avg-payload-text=每筆資料的平均有效載荷
avg-payload-tips=每筆資料的平均有效載荷
avg-unused-text=每筆資料的平均未使用位元組數
avg-unused-tips=每筆資料的平均未使用位元組數
avg-meta-text=每筆資料的平均元資料
avg-meta-tips=每筆資料的平均元資料
avg-fanout-text=平均 fanout 數
avg-fanout-tips=平均 fanout 數
gap-cnt-text=非連續頁面
gap-cnt-tips=非連續頁面
mx-payload-text=每筆資料的最大有效載荷
mx-payload-tips=每筆資料的最大有效載荷
ovfl-cnt-text=已使用的溢出資料筆數
ovfl-cnt-tips=已使用的溢出資料筆數
int-pages-text=已使用的索引頁數
int-pages-tips=已使用的索引頁數
leaf-pages-text=已使用的主頁數
leaf-pages-tips=已使用的主頁數
ovfl-pages-text=已使用的溢出頁數
ovfl-pages-tips=已使用的溢出頁數
total-pages-text=已使用的總頁數
total-pages-tips=已使用的總頁數
int-unused-text=索引頁上未使用的位元組數
int-unused-tips=索引頁上未使用的位元組數
leaf-unused-text=主頁上未使用的位元組數
leaf-unused-tips=主頁上未使用的位元組數
ovfl-unused-text=溢出頁上未使用的位元組數
ovfl-unused-tips=溢出頁上未使用的位元組數
total-unused-text=所有頁上未使用的位元組數
total-unused-tips=所有頁上未使用的位元組數
all-table-report-title=所有表 (排除索引)
all-indices-report-title=所有索引 (排除表)
tbl-and-all-idx-report-title=表 {tblName} 及其所有索引
tbl-only-report-title=表 {tblName} 排除任何索引
idx-only-report-title=表 {tblName} 的所有索引
tbl-report-title=表 {tblName}
idx-report-title=表 {tblName} 的索引 {idxName}
props-tbl-only-report-title=表 {tblName} 儲存分析
props-idx-props-only-report-title=表 {tblName} 的所有索引
db-pragma-params=PRAGMA 參數
db-quick-config-params=快捷設定方案
select-pragma=PRAGMA
pragma-analysis-limit-tips=查詢或更改近似分析 (ANALYZE) 設定的限制。這是分析 (ANALYZE) 命令在每個索引中檢查的大致列數。
pragma-application-id-tips=用於查詢或設定位於偏移量 68 處的 32 位元有號大端「Applicatioin ID」整數到資料庫頭中。
pragma-auto-vacuum-tips=在資料庫中查詢或設定自動清空狀態。
pragma-automatic-index-tips=查詢、設定或清除自動索引功能。
pragma-busy-timeout-tips=查詢或更改忙碌超時 (busy timeout) 的設定。
pragma-cache-size-tips=查詢或更改每個開啟的資料庫檔案一次在記憶體中保留的 SQLite 建議的最大資料庫磁碟頁數。
pragma-cache-spill-tips=啟用或禁用分頁程式在事務中間將髒快取頁溢出到資料庫檔案的功能。
pragma-case-sensitive-like-tips=LIKE 運算子的預設行為是忽略 ASCII 字元的大小寫。因此，預設情況下，'a' LIKE 'A' 為 true。
pragma-cell-size-check-tips=在最初從磁碟讀取資料庫 B 樹頁面時，啟用或禁用其他健全性檢查。啟用儲存格大小檢查後，可以更早地檢測到資料庫損壞，並且不太可能「擴散 (Spread)」。
pragma-checkpoint-fullfsync-tips=查詢或更改檢查點操作的 fullfsync 標記。如果設定了此標誌，則在支援 F_FULLFSYNC 的系統上執行檢查點操作期間將使用 F_FULLFSYNC 同步方法。CHECKPOINT_FULLFSYNC 標誌的預設值為 OFF。只有 Mac OS-X 支援 F_FULLFSYNC。
pragma-collation-list-tips=返回為目前資料庫連線定義的歸類序列的列表。
pragma-compile-options-tips=返回構建 SQLite 時使用的編譯時選項的名稱，每行一個選項。
pragma-count-changes-tips=查詢或更改計數更改標誌。通常，當未設定 count-changes 標誌時，INSERT、UPDATE 和 DELETE 陳述式不返回資料。
pragma-data-store-directory-tips=查詢或更改 sqlite3_data_directory 全域變數的值，Windows 作業系統介面後端使用該變數來確定儲存使用相對路徑名指定的資料庫檔案的位置。
pragma-data-version-tips=指示資料庫檔案已被修改。在記憶體中儲存資料庫內容或在螢幕上顯示資料庫內容互動程式可以使用 PRADMA data_version 命令來確定它們是否需要刷新和重新載入記憶體或更新螢幕顯示。
pragma-default-cache-size-tips=查詢或設定將為每個開啟的資料庫檔案分配的建议最大磁碟快取頁數。
pragma-defer-foreign-keys-tips=指示所有外鍵約束延遲到提交最外層的事務。
pragma-empty-result-callbacks-tips=查詢或更改空結果回呼標誌。
pragma-encoding-tips=主資料庫使用的文字編碼，'UTF-8'、'UTF-16le'(小端 UTF-16 編碼) 或'UTF-16be'(大端 UTF-16 編碼) 之一。
pragma-foreign-key-check-tips=檢查資料庫或表是否有違反外鍵約束的情況
pragma-foreign-keys-tips=查詢、設定或清除外鍵約束的實施。
pragma-freelist-count-tips=返回資料庫檔案中未使用的頁數。
pragma-full-column-names-tips=查詢或更改 full_column_names 標誌。
pragma-fullfsync-tips=查詢或更改 fullfsync 標誌。此標誌確定是否在支援 F_FULLFSYNC 同步方法的系統上使用該方法。Fullfsync 標誌的缺省值為 OFF。只有 Mac OS X 支援 F_FULLFSYNC。
pragma-hard-heap-limit-tips=對單個進程中所有資料庫連線的堆記憶體量施加限制。
pragma-ignore-check-constraints-tips=啟用或禁用檢查約束的強制。預設設定為 OFF，這意味著預設情況下強制執行檢查約束。
pragma-incremental-vacuum-tips=導致最多 N 個頁面從自由列表中刪除。
pragma-integrity-check-tips=對資料庫執行低階格式化和一致性檢查。
pragma-journal-mode-tips=查詢或設定與目前資料庫連線關聯的資料庫的日記模式。
pragma-journal-size-limit-tips=限制事務或檢查點之後保留在檔案系統中的回滾日誌和 WAL 檔案的大小。
pragma-legacy-alter-table-tips=設定或查詢 legacy_alter_table 標誌的值。
pragma-locking-mode-tips=設定或查詢資料庫連線鎖定模式。鎖定模式為正常模式 (NORMAL) 或獨佔模式 (EXCLUSIVE)。
pragma-max-page-count-tips=查詢或設定資料庫檔案中的最大頁數。
pragma-mmap-size-tips=查詢或更改為單個資料庫上的記憶體映射 I/O(memory-mapped I/O) 保留的最大位元組數。
pragma-module-list-tips=返回向資料庫連線註冊的虛擬表模組的列表。
pragma-optimize-tips=嘗試優化資料庫。
pragma-page-count-tips=返回資料庫檔案中的總頁數。
pragma-page-size-tips=查詢或設定資料庫的頁面大小。頁面大小必須是介於 512% 和 65536 之間的 2 的冪。
pragma-parser-trace-tips=打開對 SQLite 內部使用的 SQL 解析器的追蹤。使用 SQLITE_DEBUG 編譯時生效。
pragma-query-only-tips=防止資料庫檔案上的資料更改。當啟用此項時，任何 CREATE、REPORT、DROP、REPORT 或 UPDATE 嘗試都將導致 SQLITE_READONLY 錯誤。
pragma-quick-check-tips=對資料庫執行低階格式設定和一致性檢查，跳過 UNIQUE 和索引一致性檢查。
pragma-read-uncommitted-tips=查詢、設定或清除 READ UNCOMMITTED 隔離。
pragma-recursive-triggers-tips=查詢、設定或清除觸發器的遞迴功能。
pragma-reverse-unordered-selects-tips=啟用時，該 PRAGMA 會導致許多沒有 ORDER BY 子句的 SELECT 陳述式以與通常相反的順序發出結果。
pragma-schema-version-tips=獲取或設定資料庫頭中偏移量 40 處的 chema-versio 整數值。
pragma-secure-delete-tips=查詢或更改安全刪除 (secure-delete) 設定。
pragma-short-column-names-tips=查詢或更改短欄位名標誌。
pragma-soft-heap-limit-tips=對單個進程中的所有資料庫連線，限制佔用的堆記憶體量。
pragma-stats-tips=返回有關表和索引的輔助資訊。
pragma-synchronous-tips=查詢或更改「同步 (synchronous)」標誌的設定。
pragma-temp-store-tips=查詢或更改 sqlite3_temp_directory 全域變數的值，許多作業系統介面後端使用該變數來確定在何處儲存臨時表和索引。
pragma-threads-tips=預準備陳述式 (prepared statement) 啟動協助查詢的輔助執行緒數。
pragma-trusted-schema-tips=是否允許在 schema 中運行未經安全審核的 SQL 函數和虛擬表。確定是否允許視圖、觸發器或架構運算式（如 CHECK 約束、DEFAULT 子句、生成的欄位、運算式索引和/或部分索引）運行未經安全審核的 SQL 函數和虛擬表。
pragma-user-version-tips=獲取或設定資料庫頭中偏移量 60 處的 user-version 整數值
pragma-vdbe-addoptrace-tips=完整的 VDBE 操作碼在代碼生成期間創建時顯示出來。前提是 SQLite 以 SQLITE_DEBUG 選項編譯和 vdbe_debug 開啟。
pragma-vdbe-debug-tips=開啟 VDBE 除錯，前提是 SQLite 以 SQLITE_DEBUG 選項編譯
pragma-vdbe-listing-tips=在標準輸出上顯示完整的虛擬機操作碼列表。前提是 SQLite 以 SQLITE_DEBUG 選項編譯和 vdbe_debug 開啟。
pragma-vdbe-trace-tips=在計算時在標準輸出上列印虛擬機操作碼。前提是 SQLite 以 SQLITE_DEBUG 選項編譯和 vdbe_debug 開啟。
pragma-wal-autocheckpoint-tips=查詢或設定預寫日誌 (write-ahead log)/auto-checkpoint 間隔。
pragma-wal-checkpoint-tips=導致資料庫連線 D 上的資料庫 X 的預寫日誌 (write-ahead log) 中的內容被傳輸到資料庫檔案中，並重置預寫日誌 (write-ahead log)。
pragma-writable-schema-tips=可以使用普通的 UPDATE、INSERT 和 DELETE 陳述式更改 sqlite_schema 表。警告：濫用此編譯指示很容易導致資料庫檔案損壞。
pragma-save-confirm=PRAGMA 陳述式會影響資料庫運行，確定執行下面的陳述式嗎？
confirm-exec-text=確定&執行